{"id":262240,"date":"2020-07-04T07:11:34","date_gmt":"2020-07-04T07:11:34","guid":{"rendered":"https:\/\/leadsgorilla.io\/?page_id=262240"},"modified":"2022-06-21T18:20:22","modified_gmt":"2022-06-21T18:20:22","slug":"cookie-policy","status":"publish","type":"page","link":"https:\/\/leadsgorilla.io\/cookie-policy\/","title":{"rendered":"Cookie Policy"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.16&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_row _builder_version=&#8221;4.16&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.16&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_text _builder_version=&#8221;4.16&#8243; text_font=&#8221;Muli|300|||||||&#8221; text_text_color=&#8221;#000000&#8243; text_font_size=&#8221;19px&#8221; text_line_height=&#8221;1.5em&#8221; global_colors_info=&#8221;{}&#8221;]<\/p>\n<p><strong>Cookie Policy for LeadsGorilla<\/strong><br \/>This is the Cookie Policy for LeadsGorilla, accessible from https:\/\/LeadsGorilla.io<\/p>\n<p><strong>What Are Cookies<\/strong><\/p>\n<p>As is common practice with almost all professional websites this site uses cookies, which are tiny files that are downloaded to your computer, to improve your experience. This page describes what information they gather, how we use it and why we sometimes need to store these cookies. We will also share how you can prevent these cookies from being stored however this may downgrade or ‘break’ certain elements of the sites functionality.<\/p>\n<p>For more general information on cookies see the Wikipedia article on HTTP Cookies.<\/p>\n<p><strong>How We Use Cookies<\/strong><\/p>\n<p>We use cookies for a variety of reasons detailed below. Unfortunately in most cases there are no industry standard options for disabling cookies without completely disabling the functionality and features they add to this site. It is recommended that you leave on all cookies if you are not sure whether you need them or not in case they are used to provide a service that you use.<\/p>\n<p><strong>Disabling Cookies<\/strong><\/p>\n<p>You can prevent the setting of cookies by adjusting the settings on your browser (see your browser Help for how to do this). Be aware that disabling cookies will affect the functionality of this and many other websites that you visit. Disabling cookies will usually result in also disabling certain functionality and features of the this site. Therefore it is recommended that you do not disable cookies.<\/p>\n<p><strong>Email newsletters related cookies<\/strong><\/p>\n<p>This site offers newsletter or email subscription services and cookies may be used to remember if you are already registered and whether to show certain notifications which might only be valid to subscribed\/unsubscribed users.<\/p>\n<p><strong>Orders processing related cookies<\/strong><\/p>\n<p>This site offers e-commerce or payment facilities and some cookies are essential to ensure that your order is remembered between pages so that we can process it properly.<\/p>\n<p><strong>Third Party Cookies<\/strong><\/p>\n<p>In some special cases we also use cookies provided by trusted third parties. The following section details which third party cookies you might encounter through this site.<\/p>\n<p>This site uses Google Analytics which is one of the most widespread and trusted analytics solution on the web for helping us to understand how you use the site and ways that we can improve your experience. These cookies may track things such as how long you spend on the site and the pages that you visit so we can continue to produce engaging content.<\/p>\n<p>For more information on Google Analytics cookies, see the official Google Analytics page.<\/p>\n<p>From time to time we test new features and make subtle changes to the way that the site is delivered. When we are still testing new features these cookies may be used to ensure that you receive a consistent experience whilst on the site whilst ensuring we understand which optimisations our users appreciate the most.<\/p>\n<p>As we sell products it’s important for us to understand statistics about how many of the visitors to our site actually make a purchase and as such this is the kind of data that these cookies will track. This is important to you as it means that we can accurately make business predictions that allow us to monitor our advertising and product costs to ensure the best possible price.<\/p>\n<p><strong>More Information<\/strong><\/p>\n<p>Hopefully that has clarified things for you and as was previously mentioned if there is something that you aren’t sure whether you need or not it’s usually safer to leave cookies enabled in case it does interact with one of the features you use on our site.<\/p>\n<p>However if you are still looking for more information then you can contact us through one of our preferred contact methods:<\/p>\n<p>By visiting this link: <a href=\"https:\/\/leadsgorilla.reamaze.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/leadsgorilla.reamaze.com\/<\/a><\/p>\n<p><strong>Data Remover<\/strong><\/p>\n<p>If you have to have your data removed please open a ticket at <a href=\"https:\/\/leadsgorilla.reamaze.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/leadsgorilla.reamaze.com\/<\/a><\/p>\n<p>We will take care of your request asap.<\/p>\n<p>We no longer use an email address because it always gets spammed and therefore some of the emails you send get lost. So please use the ticket system.<\/p>\n<p>Thank you.<\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cookie Policy for LeadsGorillaThis is the Cookie Policy for LeadsGorilla, accessible from https:\/\/LeadsGorilla.io What Are Cookies As is common practice with almost all professional websites this site uses cookies, which are tiny files that are downloaded to your computer, to improve your experience. This page describes what information they gather, how we use it and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-template-blank.php","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":""},"_links":{"self":[{"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/pages\/262240"}],"collection":[{"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/comments?post=262240"}],"version-history":[{"count":1,"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/pages\/262240\/revisions"}],"predecessor-version":[{"id":266215,"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/pages\/262240\/revisions\/266215"}],"wp:attachment":[{"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/media?parent=262240"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}