{"id":262242,"date":"2020-07-04T07:11:13","date_gmt":"2020-07-04T07:11:13","guid":{"rendered":"https:\/\/leadsgorilla.io\/?page_id=262242"},"modified":"2022-06-21T18:19:40","modified_gmt":"2022-06-21T18:19:40","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/leadsgorilla.io\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.16&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_row _builder_version=&#8221;4.16&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.16&#8243; global_colors_info=&#8221;{}&#8221;][et_pb_text _builder_version=&#8221;4.16&#8243; text_font=&#8221;Muli|300|||||||&#8221; text_text_color=&#8221;#000000&#8243; text_font_size=&#8221;18px&#8221; text_line_height=&#8221;1.5em&#8221; global_colors_info=&#8221;{}&#8221;]<\/p>\n<p><strong>Policies and Procedures<\/strong><br \/>Privacy Policy – LeadsGorilla.io<br \/>(Last Updated: July 5th, 2020)<\/p>\n<p>LeadsGorilla.io is serious about protecting your online privacy. This Privacy Statement explains our views and practices concerning privacy, and how they may pertain to you as a user of our website.<\/p>\n<p>“You” or “Your” means you as a participant in or as a user of the LeadsGorilla.io website. “We” or “Our” or “Us” means LeadsGorilla.io. “Our site” means LeadsGorilla.io.<br \/>All information transmitted, printed or otherwise submitted to LeadsGorilla.io via this website shall be deemed to be the property of LeadsGorilla.io and LeadsGorilla.io shall be free to use such information for any lawful purpose as detailed herein.<\/p>\n<p>This site contains links to other sites and we are not responsible for the privacy practices or the content of such sites.<br \/>We reserve the right to release such information to law enforcement or other governmental officials as we, in our sole and absolute discretion, deem necessary to comply with the law.<\/p>\n<p>We are not affiliated, associated, authorized, endorsed by, or in any way officially connected with Facebook, Google, or any of its subsidiaries or its affiliates. The name “Facebook” “Google” as well as related names, marks, emblems and images are registered trademarks.<\/p>\n<p>The use in this website and\/or in related promotional print or video material of trademarked names and images is strictly for editorial and descriptive purposes, and no commercial claim to their use, or suggestion of sponsorship or endorsement, is made by LeadsGorilla. Those words or terms that the authors and publisher have reason to believe are trademarks are designated as such by the use of initial capitalization, where appropriate. However no attempt has been made to identify or designate all words or terms to which trademark or other proprietary rights may exist. Nothing contained herein is intended to express a judgment on, or affect the validity of legal status of, any word or term as a trademark, service mark, or other proprietary mark.<\/p>\n<p><strong>Section 1: Collected Information<\/strong><br \/>We automatically collect and\/or track the following:<br \/>1. Web page http headers (home server domain names, IP address, type of client computer, and type of Web browser);<br \/>2. Information knowingly provided by you through on-line forms, registration forms, surveys, and\/or other entries, such as email addresses, personal, financial or demographic information;<br \/>3. Information, user specific or aggregate, on what pages our visitors access; and<br \/>4. E-mail addresses of visitors that communicate with LeadsGorilla.io via e-mail.<\/p>\n<p><strong>Section 2: Use of Data Collected<\/strong><br \/>We use your personal, demographic and profile data to enhance your experience at our site and to enable us to present content we think you might be interested in. We use your contact information to send you information about our company and promotional material from our partners. We may also use your personal, demographic and profile data to improve our site, for statistical analysis, for marketing and promotional purposes, and for editorial or feedback purposes for our advertisers. Information collected by us may be added to our databases and used for future telemarketing, SMS text-messaging, e-mails or postal mailings regarding site updates, new products and services, upcoming events, and\/or status of orders placed online. By using this site, you agree that you may be contacted in any manner contemplated in this section even if your number is found on a do not call registry, in-house list or similar registry.<\/p>\n<p><strong>Section 3: Disclosure of Data to Third Parties<\/strong><br \/>If you choose to provide personal information, it will be used for the following purposes:<br \/>1. Considering you for a LeadsGorilla.io product;<br \/>2. As required by law; and<br \/>3. For marketing products and services which we determine, in our sole judgment, that you might find of interest. We reserve the right to share, rent, sell, or otherwise disclose data we collect to third parties. Any third party we share, rent, sell, or otherwise disclose data to will be prescreened by us, determined by us to be reputable, and will use the personal data for marketing products and services which we determine, in our sole judgment, that you might find of interest.<\/p>\n<p><strong>Section 4: Your Opt-Out Rights<\/strong><br \/>You may opt-out of receiving communications from us and\/or our partners by not submitting your information. We also allow you to remove your information from our marketing lists. If you remove your information from our marketing lists it will no longer be used by us to send promotional correspondence to you. You can remove your information from our marketing lists by clicking on the “Unsubscribe” link at the bottom of every email we send you, or by sending your request, in writing, via email to: contact@LeadsGorilla.io<\/p>\n<p><strong>Section 5: We Do Not Intend to Collect Data from Children<\/strong><br \/>The information and services provided to us or our affiliates, sponsors, and advertisers are not intended to be viewed by children (under 18 years old). No information collected from children is knowingly used for any marketing or promotional purposes whatsoever, either inside or outside LeadsGorilla.io. No part of LeadsGorilla.io’s web site is structured to attract anyone under the age of 18.<\/p>\n<p><strong>Section 6: Our Right to Contact You<\/strong><br \/>We reserve the right to contact you regarding your account status and changes to subscriber agreements, privacy policy, or any other policies or agreements relevant to you.<\/p>\n<p><strong>Section 7: Our Right to Change<\/strong><br \/>We reserve the right to change this policy at any time by notifying you of the existence and location of the new or revised privacy policy or by posting the changes online at our site.<\/p>\n<p><strong>Section 8: Our Contact Information<\/strong><br \/>If you have any questions about this privacy statement, the practices of this site, or your dealings with this website, you can contact us via email sent to: contact@LeadsGorilla.io.<\/p>\n<p><strong>Section 9: Anti Spam Policy. Can-Spam Act Compliance<\/strong><br \/>LeadsGorilla.io is dedicated to ensuring compliance with the ‘Can-Spam Act’, which took effect January 1, 2004. You may receive email from LeadsGorilla.io in the following circumstances:<br \/>1. Acknowledging your application has been received and requesting additional action<br \/>2. Requests for additional information to support your current application<br \/>3. Response to your inquiries regarding the status of your transactional requests<br \/>4. Thanking you for your valued business<br \/>5. Advertisements for our products, services, changes in services, new product availability<br \/>6. Advertisements for third party products and services where we have determined that such product or service may be of interest to our customers<br \/>To ensure compliance with the Can-Spam Act, LeadsGorilla.io has implemented the following guidelines for email delivery:<br \/>1. All emails sent to you by LeadsGorilla.io will clearly identify LeadsGorilla.io as the sender. FROM \/ SENDER: someone@LeadsGorilla.io (NOTE: The actual sender will alter from department to department, but all from addresses will end with @LeadsGorilla.io).<br \/>2. The Subject Line of any email you receive will always accurately describe the subject matter of the email.<br \/>3. Any email from LeadsGorilla.io will include the ability to unsubscribe from future email messages.<br \/>4. Unsubscribing will ensure the customer is removed from ALL lists at LeadsGorilla.io; this excludes customer service emails regarding the processing and status of a current product.<br \/>5. All emails sent to you directly by LeadsGorilla.io include valid postal address information in the footer.<br \/>6. All third party marketing partners are required to comply with the Can-Spam Act.<br \/>7. Emails sent to you directly by LeadsGorilla.io will include an email address and physical address where you can send suggestions, complaints or other correspondence.<\/p>\n<p><strong>Section 10: Information for ISPs<\/strong><br \/>Web site: LeadsGorilla.io<br \/>Support: <a href=\"https:\/\/leadsgorilla.reamaze.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/leadsgorilla.reamaze.com\/<\/a><\/p>\n<p>LeadsGorilla.io understands consumers’ concerns over the use of their personal information. We hope this information will relieve any concerns your company may have regarding our email policies. LeadsGorilla.io and its affiliated sites use only an “opt-in or opt out” method of obtaining customer information, and it is not our policy or desire to send unsolicited email. We obtain email addresses and personal information from third parties that follow the same set of policies. LeadsGorilla.io email messages sent always include information about the origin of the emails and instructions on how recipients can unsubscribe from receiving future email messages.<br \/>From time to time, LeadsGorilla.io will enter into an arrangement with a third party website to allow individuals to opt into our marketing program on those third party websites. In each case the third party websites have represented and warranted to us, among other things,<br \/>1. that the data was collected voluntarily from individuals on website registrations and co-registrations,<br \/>2. that the sellers have a right, under any applicable privacy statements, to transfer the data to us, and<br \/>3. that LeadsGorilla.io has the right to send marketing offers to the individuals.<\/p>\n<p>We hope this information satisfies any questions or concerns you may have regarding the email practices of LeadsGorilla.io.<\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Policies and ProceduresPrivacy Policy – LeadsGorilla.io(Last Updated: July 5th, 2020) LeadsGorilla.io is serious about protecting your online privacy. This Privacy Statement explains our views and practices concerning privacy, and how they may pertain to you as a user of our website. “You” or “Your” means you as a participant in or as a user of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-template-blank.php","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":""},"_links":{"self":[{"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/pages\/262242"}],"collection":[{"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/comments?post=262242"}],"version-history":[{"count":1,"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/pages\/262242\/revisions"}],"predecessor-version":[{"id":266211,"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/pages\/262242\/revisions\/266211"}],"wp:attachment":[{"href":"https:\/\/leadsgorilla.io\/wp-json\/wp\/v2\/media?parent=262242"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}